app/controllers/songs_controller.rb

INSERT INTO "songs" ("artist", "name", "genre", "description", "album", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["artist", ""], ["name", ""], ["genre", ""], ["description", ""], ["album", ""], ["rating", ""], ["created_at", "2018-07-06 09:30:53.843989"], ["updated_at", "2018-07-06 09:30:53.843989"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "songs" SET "description" = ?, "rating" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["description", "Een van de meest complexe nummers ooit gemaakt. Favoriete nummer. Optimistisch."], ["rating", "0"], ["updated_at", "2018-07-07 12:37:35.368948"], ["id", 1]]
---
  def update
    @song = Song.find(params[:id])

    if @song.update(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 3]]
---
  def destroy
    @song = Song.find(params[:id])
    @song.destroy

SELECT "songs".* FROM "songs" WHERE (artist LIKE '%#{search}%' OR name LIKE '%#{search}%' OR genre LIKE '%#{search}%' OR score LIKE '%#{search}%' OR rating LIKE '%#{search}%')
SELECT "songs".* FROM "songs"
---
  def sort
    if params[:search]
      @songs = Song.where("artist LIKE ? OR name LIKE ? OR genre LIKE ? OR score LIKE ? OR rating LIKE ?",
      "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")
    else
      @songs = Song.all